result/20220702-161403_98a1fb2960688f096570a6b14c2266b85bbf83db/benchmark/ab.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        35241 bytes

Concurrency Level:      1
Time taken for tests:   30.894 seconds
Complete requests:      18
Failed requests:        0
Total transferred:      641034 bytes
HTML transferred:       634338 bytes
Requests per second:    0.58 [#/sec] (mean)
Time per request:       1716.314 [ms] (mean)
Time per request:       1716.314 [ms] (mean, across all concurrent requests)
Transfer rate:          20.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  1698 1716  58.3   1703    1950
Waiting:     1698 1716  58.2   1703    1949
Total:       1698 1716  58.4   1703    1950

Percentage of the requests served within a certain time (ms)
  50%   1703
  66%   1704
  75%   1705
  80%   1706
  90%   1706
  95%   1950
  98%   1950
  99%   1950
 100%   1950 (longest request)